question_1 = """
1.  **甲輸入私下偷記的密碼登入A的手機查看，可能成立刑法第358條侵入電腦罪**
    -   客觀上甲未經持有人A同意，輸入其手號密碼而登入查看對話內容，該手機自屬A之電腦，客觀構成要件該當。
    -   主觀上甲對於上開情狀既知且欲，且無正當理由，又無其他阻卻違法及罪責事由，成立本罪。

2.  **甲閱讀A與客戶之對話紀錄，可能成立刑法第315條妨害書信秘密罪**
    -   客觀上甲雖未經A與客戶同意而觀看對話紀錄，然對話紀錄僅屬數位資料依照刑法第220條2項規定，電腦之數位資料固屬準文書而得為本罪之行為客體，惟本罪所處罰之行為係窺視他人文件內容之妨害文件秘密行為，僅以他人之封緘文件為限。因此電腦處理之電磁紀錄，必須是經過加密處理者，始屬本罪適格之行為客體。依此，A與客戶既未對於通話紀錄內容加密，自非本罪客體，故甲不成立本罪。
    -   且學說上亦有認為傳統刑法之「封緘」解釋成電腦數位資料之「加密處理」，有無牴觸罪刑法定原則中派生之類推適用之禁止，則不無疑問，因此，為了避免牴觸類推禁止原則，不宜將經過加密處理之電腦資料解釋為本條之「他人之封緘文書」。依此見解，甲觀看對話紀錄內容行為自不能夠成立本罪。

3.  **甲將相關對話截圖的行為可能成立刑法第315-1條2款竊錄罪**
    -   惟本罪所稱之非公開言論、談話限於現場之談話，A與客戶間之對話紀錄既非現場對話，甲自不構成本罪。

4.  **甲為取證乃將相關對話截圖，並將該對話截圖從A的手機轉寄到自己的手機予以存檔，可能成立刑法第359條無故取得他人電磁紀錄罪**
    -   客觀上A與客戶之對話紀錄係處存於A電腦之電磁紀錄，惟甲係以截圖對話紀錄方式製作新的電磁紀錄，是否合於本罪所稱之取得行為，容有爭議：
    -   否定說：甲並非取得電磁紀錄本身，儘管甲的行為可能破壞A對於電磁紀錄之獨佔性並造成A法益侵害，然本於罪刑法定原則，不屬於本罪所稱取得。
    -   肯定說：實務見解認為縱使原所有人仍繼續保有電磁紀錄的支配占有狀態，如行為人以包括複製等方法，將他人的電磁紀錄，移轉為自己所有的情形，因已破壞權利人對電磁紀錄獨占性及完整使用利益，並致公眾或他人受法律保護之利益受有損害，仍該當此罪的成立。
    -   學生以為，實務見解已逸脫文義解釋最大範疇，本於罪刑法定原則之類推禁止，應以否定說適當，甲的行為不構成本罪。

5.  **甲對A性交可能成立刑法第225條1項趁機性交罪**
    -   客觀上甲僅是單純的「利用」A喝到斷片不知抗拒之狀態，而非甲故意製造使被害人處於此等狀態，屬本罪之利用並對A為性交行為，主觀上具備故意，沒有其他阻卻違法及罪責事由，成立本罪。

6.  **甲拍下A性交畫面，可能成立刑法第319-1條1項攝錄性影像罪**
    -   甲A之性交之行為屬於刑法第10條8項1款所稱之性影像，甲未經A同意而以錄影方法攝錄其性影像，客觀構成要件該當。
    -   主觀上具備故意，沒有其他阻卻違法及罪責事由，成立本罪。
    -   本罪與刑法第315-1條2款竊錄罪同為保護隱私法益，惟319-1條乃是針對性隱私法益特別規範，因此優先適用319-1條。

7.  **甲揚言將性交影片上傳社群媒體使A不敢與甲客戶聯繫，可能成立刑法第304條強制罪**
    -   客觀上甲透過散布性交影片之脅迫行為，使A不得不放棄與客戶聯繫權利，主觀上甲對於上開情狀均有認識並決意為之，構成要件該當。
    -   由於本罪屬於「開放性構成要件」因此須於違法性層次進行正面審查，然自手段觀之甲散布性交影片方式仍具有社會可非難性，且手段與目的之間亦不具備合理關聯性仍具備違法性，亦無其他阻卻罪責事由，成立本罪。

8.  **甲將性交影片上傳臉書，可能成立刑法第319-3條2項散布性影像罪**
    -   客觀上甲未經被害人A同意而將性影像上傳到社群媒體，係一散播傳布使不特定人或多數人得以知悉之行為，構成要件該當。主觀上A具備故意，且無正當理由具備違法性及罪責，成立本罪。

9.  **甲將性影像散布，可能成立刑法第235條散布猥褻物品罪**
    -   依照實務見解，猥褻物品尚需「侵害性的道德感情，有礙社會風化」因此性影像之概念較猥褻定義廣範，然就甲與A性愛畫面屬於其他在客觀上足以刺激或滿足性慾，令ㄧ般人感覺不堪呈現於眾或不能忍受而排拒之猥褻資訊，依照大法官釋字617號解釋只要採取適當安全隔離措施，即可免除其刑。本案中甲既未採取任何隔絕措施而將其散播傳布至其臉書，客觀構成要件該當。
    -   主觀上A具備故意，且無其它阻卻違法及罪責事由，成立本罪。

10. **甲的上開行為，可能成立刑法第310條2項加重誹謗罪**
    -   實務見解有認為上傳他人含有性器官之性交畫面，客觀上足使一般人對被害人產生行為不檢、道德倫常觀念低落之負面觀感，而對被害人之品德、身分、人格、地位造成相當貶抑，屬於誹謗行為。
    -   然學生以為上傳性交畫面影片僅係傳達被害人有為性交行為，客觀上是否足以使A名譽受負面評價，容有爭議，客觀構成要件不該當不成立本罪。

11. **競合**
    -   甲散布影像成立刑法319-3條2項加重散布攝錄影像罪、235條散布猥褻物品罪，想像競合從一重處斷，再與358條侵入電腦罪、319-1條1項加重攝錄性影像罪、304條強制罪、225條趁機性交罪，數罪併罰之。
"""